{
    "data": [
        {
            "id": 1,
            "date": "11/14/2019",
            "post": "There were chicken intestines, fish balls, quail eggs cooked in the orange batter, grilled chicken blood, and MY FAVORITE pig intestines. AHHH. It was like my childhood all over again! Some people would probably say “YUCK” to these types of food. I mean, it’s understandable. But if you ever get a chance, it would be an opportunity to learn a little bit about my culture. Plus, they are great protein sources and most of them are REALLY REALLY REALLY delicious, especially if you pair them with the sweet sauce or the vinegar sauce that the vendors make. #Filipino Pride. "
        },
        {
            "id": 2,
            "date": "10/2/2019",
            "post": "At first, I was sad because I really wanted to go off campus for the trip. But looking back, I was really glad I went. I learned that putting on skis could actually be complicated, especially when there’s ice stuck inside. If that ever happens, pour some hot water on it! I fell a lot of times and even crashed into a tree. But it’s okay. It was all part of the experience!"
        },
        {
            "id": 3,
            "date": "9/23/2019",
            "post": "We would go there super early in the morning (before the sun rises) to find a good spot next to my mom’s because the place would get so crowded. We would set up a tent, settle all the food the we brought on a “banig” and eat as one big happy family. My cousins would even bring a kites, cards, or badminton so we could all do something fun together. This was how I grew up spending that time of the year. But throughout my college experience, Bowdoin showed me that there are other ways to celebrate and I am excited to explore my options!"
        },
        {
            "id": 4,
            "date": "9/3/2019",
            "post": "I learned a little bit about Henry Huntington, the founder of The Huntington. In his later years, he actually married his uncle’s widow, Arabella Huntington, and together they transformed the place. They were fascinated by books, art, and gardens. So today, The Huntington has a library, where you can find the Gutenberg Bible, a European art gallery, and about 12 different botanical gardens, such as the Japanese Garden, the Desert Garden, and the Jungle Garden. The best part about visiting The Huntington for me would probably be seesing a lot of bonsai trees. I could imagine their trunks as tiny bodies of dinosaurs! It was so cool. I also really liked the Jungle Garden because it made me feel like I was in the Hunger Games. The Children’s Garden was also very adorable, especially the water fountains!  Overall, it was such a beautiful day! Plus, I got my exercise for the year. I might have walked about 6 miles that day!"
        },
        {
            "id": 5,
            "date": "6/14/2019",
            "post": "Anyway, so this picture was taken at Lombard St, which is famous for its steep, one-block squiggly road filled with gorgeous looking flowers. So if you find yourself driving around SF city one day, make sure to come by Lombard St. It’s pretty cool!"
        },
        {
            "id": 6,
            "date": "6/10/2019",
            "post": "It was probably the highlight of my first road trip ever and I would love to go back! Unfortunately, we didn’t get to spend a lot of time at the park. I think we only stayed there for about three hours and we spent half the time taking pictures. If I were to go back, I would definitely take my dad because I want him to take some time to relax and enjoy life. It could be a really great bonding moment for both of us!"
        },
        {
            "id": 7,
            "date": "8/19/2018",
            "post": "I have not seen the movie so I’m not sure how different it is from the book. But I recommend it. The best part about it though was that it made me look up videos of hatching turtles on YouTube. :) Lots of people go to The Last Bookstore to take pictures, film music videos, buy or read some books, listen to some educational talks, or just hangout. There’s also an art gallery and some of the sculptures around the store are amazing. In other words, The Last Bookstore is a really cool space and it’s easy to get there! Just take the red line to Pershing Square and you're two block away!"
        },
        {
            "id": 8,
            "date": "4/26/2018",
            "post": "I would say that my first slide, Neptune’s Fury, made me a bit more courageous for all the rides that followed. Although I was nervous at first, it felt really nice, especially with the water splashing on my face and my friends screaming. The unpredictable turns and sways of the purple tube in complete darkness were super exciting! I also we went to the the Bermuda Triangle. Then the High Extreme, which was an INTENSE workout because the walk to get up the slide took longer than the sliding down. Then the Lily Pads, which I didn’t really like that much because the ride made my arms and my upper body sore the next day. But I have no complaints. At least I’m getting muscles! Next was the Ragin’ Racer, where I lost BADLY, then the Wave Cove and then the Amazon Adventure, also known as the Lazy River, which was one of my favorites too."
        },
        {
            "id": 9,
            "date": "3/6/2018",
            "post": "We walked around a trail and took pictures. We looked for the geocache box, which had lots of random things in it including a pine cone, a business card, and a coin. We also spent some time admiring the water, the trees, and the rocks! I have so much appreciation for nature’s beauty."
        },
        {
            "id": 10,
            "date": "1/6/2018",
            "post": "But I took lots of pictures and jumped from one rock to the next. Above all, I was with my friends. That’s all that matters! On our walk, we saw couples and families. There was even a wedding at the park near it! For me, Breakwater Lighthouse seemed like a place of love!"
        }
    ]
}